stderr of test 'analytics11` in directory 'sql/test/analytics` itself:


# 14:50:26 >  
# 14:50:26 >  "mserver5" "--debug=10" "--set" "gdk_nr_threads=0" "--set" "mapi_open=true" "--set" "mapi_port=33540" "--set" "mapi_usock=/var/tmp/mtest-19672/.s.monetdb.33540" "--forcemito" "--dbpath=/home/ferreira/repositories/MonetDB-grouping-analytics/BUILD/var/MonetDB/mTests_sql_test_analytics" "--set" "embedded_c=true"
# 14:50:26 >  

# builtin opt 	gdk_dbpath = /home/ferreira/repositories/MonetDB-grouping-analytics/BUILD/var/monetdb5/dbfarm/demo
# builtin opt 	mapi_port = 50000
# builtin opt 	mapi_open = false
# builtin opt 	mapi_ipv6 = false
# builtin opt 	mapi_autosense = false
# builtin opt 	sql_optimizer = default_pipe
# builtin opt 	sql_debug = 0
# cmdline opt 	gdk_nr_threads = 0
# cmdline opt 	mapi_open = true
# cmdline opt 	mapi_port = 33540
# cmdline opt 	mapi_usock = /var/tmp/mtest-19672/.s.monetdb.33540
# cmdline opt 	gdk_dbpath = /home/ferreira/repositories/MonetDB-grouping-analytics/BUILD/var/MonetDB/mTests_sql_test_analytics
# cmdline opt 	embedded_c = true
#client2:!ERROR:ParseException:SQLparser:42000!syntax error, unexpected ')' in: "select
#client2:!ERROR:    grouping()"
#client2:!ERROR:ParseException:SQLparser:42000!SELECT: cannot use non GROUP BY column 'product_name' in query results without an aggregate function

# 14:50:27 >  
# 14:50:27 >  "mclient" "-lsql" "-ftest" "-tnone" "-Eutf-8" "-i" "-e" "--host=/var/tmp/mtest-19672" "--port=33540"
# 14:50:27 >  

MAPI  = (monetdb) /var/tmp/mtest-19672/.s.monetdb.33540
QUERY = SELECT
            GROUPING()
        FROM tbl_ProductSales
        GROUP BY Product_Category; --error, "grouping" requires arguments
ERROR = !syntax error, unexpected ')' in: "select
        !    grouping()"
CODE  = 42000
MAPI  = (monetdb) /var/tmp/mtest-5184/.s.monetdb.34105
QUERY = SELECT
            1
        FROM tbl_ProductSales
        GROUP BY GROUPING(Product_Name); --error, "grouping" not allowed inside GROUP BY
ERROR = !GROUPING: aggregate function 'grouping' not allowed in GROUP BY clause
CODE  = 42000
MAPI  = (monetdb) /var/tmp/mtest-11452/.s.monetdb.32908
QUERY = SELECT
            1
        FROM tbl_ProductSales
        WHERE GROUPING(Product_Category) > 1
        GROUP BY GROUPING SETS((Product_Category)); --error, "grouping" not allowed in where clause
ERROR = !GROUPING: aggregate functions not allowed in WHERE clause
CODE  = 42000
MAPI  = (monetdb) /var/tmp/mtest-11452/.s.monetdb.32908
QUERY = SELECT 
            AVG(GROUPING(Product_Category))
        FROM tbl_ProductSales
        GROUP BY GROUPING SETS((Product_Category)); --error, "grouping" not allowed inside aggregation functions
ERROR = !GROUPING: aggregate functions cannot be nested
CODE  = 42000
MAPI  = (monetdb) /var/tmp/mtest-12109/.s.monetdb.39866
QUERY = SELECT
            GROUPING(1)
        FROM tbl_ProductSales
        GROUP BY Product_Category; --error, "grouping" requires group columns as input
ERROR = !syntax error, unexpected sqlINT in: "select
        !    grouping(1"
CODE  = 42000
MAPI  = (monetdb) /var/tmp/mtest-5184/.s.monetdb.34105
QUERY = SELECT
            col1 IN (SELECT ColID + col2 FROM tbl_ProductSales)
        FROM another_T
        GROUP BY ROLLUP(col1); --error, col2 is not a grouping column
ERROR = !SELECT: cannot use non GROUP BY column 'col2' in query results without an aggregate function
CODE  = 42000
MAPI  = (monetdb) /var/tmp/mtest-3400/.s.monetdb.37634
QUERY = SELECT
            (SELECT GROUPING(t1.col1) FROM tbl_ProductSales)
        FROM another_T t1; --error, PostgreSQL gives: arguments to GROUPING must be grouping expressions of the associated query level
ERROR = !GDK reported error: mergejoin: more than one match
MAPI  = (monetdb) /var/tmp/mtest-1456258/.s.monetdb.39356
QUERY = SELECT
            GROUPING(ColID, ColID)
        FROM tbl_ProductSales
        INNER JOIN tbl_X
        ON tbl_ProductSales.ColID = tbl_X.ColID
        GROUP BY CUBE(tbl_ProductSales.Product_Category); --error, ambiguous identifier
ERROR = !SELECT: identifier 'colid' ambiguous
CODE  = 42000

# 14:50:27 >  
# 14:50:27 >  "Done."
# 14:50:27 >  

